# Erase Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectorSet..::..Erase Method
ConnectorSet Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	Connector item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As Connector _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	Connector^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..Connector
# See Also
ConnectorSet Class
Autodesk.Revit.DB Namespace